In [1]:
import os
import numpy as np
import pandas as pd

# Load Data

## Load Uploaded Data to classify

In [2]:
# Choose file
filename = "german-500.csv"
path = os.path.join("..","raw_data","test",filename)

In [3]:
path

'../raw_data/test/german-500.csv'

In [4]:
df = pd.read_csv(path, sep=";",encoding='latin-1', names=["name","country","continent"])

In [5]:
df

           name  country  continent
0          name  country  continent
1         Marie  Austria     Europe
2        Sophie  Germany     Europe
3    Maximilian  Germany     Europe
4         Maria   Brazil   Americas
..          ...      ...        ...
495      Dennis      NaN        NaN
496      Elijah      NaN        NaN
497     Emanuel      NaN        NaN
498       Ensar      NaN        NaN
499       Erich      NaN        NaN

[500 rows x 3 columns]

In [6]:
df.shape

(500, 3)

## Load Name Database

In [11]:
def load_data():
    path = os.path.join("..","raw_data","wgnd_2_0_name-gender-code.csv")
    df = pd.read_csv(path)

    # Clean data
    # kick out where gender is not defined
    df = df[df["gender"] !="?"]

    # add country names and regions
    path_cc = os.path.join("..","raw_data","country-code","all-country-codes_continent_subregion.csv")
    cc_all = pd.read_csv(path_cc, sep=",")
    cc_short = cc_all[["alpha-2", "name", "region", "sub-region"]].copy()
    cc_short.rename(columns={"name":"country"}, inplace=True)
    df.rename(columns={"code":"alpha-2" }, inplace=True)

    # merge data and country info
    data = pd.merge(df, cc_short, how="left", on="alpha-2")
    continent_list = data["region"].unique()
    # clean merged data
    data = data[data["alpha-2"] != "??"] #filter out names where there is no country assigned
    # smal letters for country and region
    data["country"] = data["country"].apply(lambda x: x.lower())
    data["region"] = data["region"].apply(lambda x: x.lower())

    return data

In [12]:
data = load_data()

In [13]:
data

,name,alpha-2,gender,wgt,country,region,sub-region
0,a,AU,M,1.000000,australia,oceania,Australia and New Zealand
1,a,BE,F,0.348178,belgium,europe,Western Europe
2,a,BE,M,0.651822,belgium,europe,Western Europe
3,a,CA,F,0.214286,canada,americas,Northern America
4,a,CA,M,0.785714,canada,americas,Northern America
...,...,...,...,...,...,...,...
4577575,힘찬,KR,M,1.000000,"korea, republic of",asia,Eastern bu
4577576,凉,CN,F,0.500000,china,asia,Eastern Asia
4577577,凉,CN,M,0.500000,china,asia,Eastern Asia
4577578,凉峰,CN,M,1.000000,china,asia,Eastern Asia
4577579,凉翼,CN,M,1.000000,china,asia,Eastern Asia

In [14]:
data.sample(5)

              name alpha-2 gender       wgt country region     sub-region
3739521         夏芳      CN      F  0.787879   china   asia   Eastern Asia
4507679         陵昆      CN      M  1.000000   china   asia   Eastern Asia
4260616         科琰      CN      M  1.000000   china   asia   Eastern Asia
2543756  revunappa      IN      M  1.000000   india   asia  Southern Asia
4549348         骏晶      CN      M  0.500000   china   asia   Eastern Asia

# Clean and convert Data

## Convert input to string and lower string

In [15]:
df["name"] = df["name"].astype(str)
df["country"] = df["country"].astype(str)
df["continent"] = df["continent"].astype(str)

In [16]:
df["name"] = df["name"].apply(lambda x: x.lower())
df["country"] = df["country"].apply(lambda x: x.lower())
df["continent"] = df["continent"].apply(lambda x: x.lower())

In [17]:
df

           name  country  continent
0          name  country  continent
1         marie  austria     europe
2        sophie  germany     europe
3    maximilian  germany     europe
4         maria   brazil   americas
..          ...      ...        ...
495      dennis      nan        nan
496      elijah      nan        nan
497     emanuel      nan        nan
498       ensar      nan        nan
499       erich      nan        nan

[500 rows x 3 columns]

## Create country, continent  list

In [18]:
# Country list
country_list = data["country"].unique()
country_list = sorted(country_list)
country_list.insert(0, "No Selection")
country_list

['No Selection',
 'afghanistan',
 'albania',
 'algeria',
 'andorra',
 'angola',
 'antigua and barbuda',
 'argentina',
 'armenia',
 'aruba',
 'australia',
 'austria',
 'azerbaijan',
 'bahamas',
 'bahrain',
 'bangladesh',
 'barbados',
 'belarus',
 'belgium',
 'belize',
 'benin',
 'bhutan',
 'bolivia (plurinational state of)',
 'bosnia and herzegovina',
 'botswana',
 'brazil',
 'brunei darussalam',
 'bulgaria',
 'burkina faso',
 'burundi',
 'cambodia',
 'cameroon',
 'canada',
 'central african republic',
 'chad',
 'chile',
 'china',
 'colombia',
 'comoros',
 'congo',
 'congo, democratic republic of the',
 'costa rica',
 'croatia',
 'cuba',
 'cyprus',
 'czechia',
 "côte d'ivoire",
 'denmark',
 'djibouti',
 'dominica',
 'dominican republic',
 'ecuador',
 'egypt',
 'el salvador',
 'equatorial guinea',
 'eritrea',
 'estonia',
 'eswatini',
 'ethiopia',
 'fiji',
 'finland',
 'france',
 'gabon',
 'gambia',
 'georgia',
 'germany',
 'ghana',
 'greece',
 'greenland',
 'grenada',
 'guatemala',
 'guinea',
 'guinea-bissau',
 'guyana',
 'haiti',
 'holy see',
 'honduras',
 'hungary',
 'iceland',
 'india',
 'indonesia',
 'iran (islamic republic of)',
 'iraq',
 'ireland',
 'israel',
 'italy',
 'jamaica',
 'japan',
 'jordan',
 'kazakhstan',
 'kenya',
 'kiribati',
 "korea (democratic people's republic of)",
 'korea, republic of',
 'kuwait',
 'kyrgyzstan',
 "lao people's democratic republic",
 'latvia',
 'lebanon',
 'lesotho',
 'liberia',
 'libya',
 'liechtenstein',
 'lithuania',
 'luxembourg',
 'madagascar',
 'malawi',
 'malaysia',
 'mali',
 'malta',
 'marshall islands',
 'mauritania',
 'mauritius',
 'mexico',
 'moldova, republic of',
 'monaco',
 'mongolia',
 'montenegro',
 'morocco',
 'mozambique',
 'namibia',
 'nauru',
 'nepal',
 'netherlands',
 'new zealand',
 'nicaragua',
 'niger',
 'nigeria',
 'north macedonia',
 'norway',
 'oman',
 'pakistan',
 'palau',
 'panama',
 'papua new guinea',
 'paraguay',
 'peru',
 'philippines',
 'poland',
 'portugal',
 'qatar',
 'romania',
 'russian federation',
 'rwanda',
 'saint kitts and nevis',
 'saint lucia',
 'saint vincent and the grenadines',
 'samoa',
 'san marino',
 'sao tome and principe',
 'saudi arabia',
 'senegal',
 'serbia',
 'seychelles',
 'sierra leone',
 'singapore',
 'slovakia',
 'slovenia',
 'solomon islands',
 'somalia',
 'south africa',
 'spain',
 'sri lanka',
 'sudan',
 'sweden',
 'switzerland',
 'syrian arab republic',
 'taiwan, province of china',
 'tajikistan',
 'tanzania, united republic of',
 'thailand',
 'togo',
 'tokelau',
 'tonga',
 'trinidad and tobago',
 'tunisia',
 'turkey',
 'turkmenistan',
 'tuvalu',
 'uganda',
 'ukraine',
 'united arab emirates',
 'united kingdom of great britain and northern ireland',
 'united states of america',
 'uruguay',
 'uzbekistan',
 'vanuatu',
 'venezuela (bolivarian republic of)',
 'viet nam',
 'yemen',
 'zambia',
 'zimbabwe']

In [19]:
# Continent List
continents_list = data["region"].unique()

## Shorten Dataframe with input names

In [20]:
# Filter Large Data frame with only names

In [21]:
data = data[data['name'].isin(df["name"])]

In [22]:
data.shape

(23714, 7)

# Test for single name

In [23]:
%%time
# For name and country
df_test = data[(data["name"] == "paul") & (data["country"] == "germany")]
df_test

CPU times: user 3.12 ms, sys: 731 µs, total: 3.85 ms
Wall time: 3.62 ms

         name alpha-2 gender  wgt  country  region      sub-region
2269079  paul      DE      M  1.0  germany  europe  Western Europe

In [24]:
%%time

df_test = data[(data["name"] == "paul")]
df_test

CPU times: user 2.22 ms, sys: 521 µs, total: 2.74 ms
Wall time: 2.25 ms

,name,alpha-2,gender,wgt,country,region,sub-region
2269057,paul,AG,M,1.000000,antigua and barbuda,americas,Latin America and the Caribbean
2269058,paul,AT,M,1.000000,austria,europe,Western Europe
2269059,paul,AU,F,0.000153,australia,oceania,Australia and New Zealand
2269060,paul,AU,M,0.999847,australia,oceania,Australia and New Zealand
2269061,paul,BB,M,1.000000,barbados,americas,Latin America and the Caribbean
...,...,...,...,...,...,...,...
2269142,paul,VU,M,1.000000,vanuatu,oceania,Melanesia
2269143,paul,WS,M,1.000000,samoa,oceania,Polynesia
2269144,paul,ZA,M,1.000000,south africa,africa,Sub-Saharan Africa
2269145,paul,ZM,M,1.000000,zambia,africa,Sub-Saharan Africa
2269146,paul,ZW,M,1.000000,zimbabwe,africa,Sub-Saharan Africa

# Main functions

In [25]:
def csv_share_male_female(result):
    """
    Takes a dataframe and calculates the probability of femal and male
    """
    male = 0
    female = 0
    male_p = 0
    female_p = 0
    # Make a list out of the grouped table results
    result_list = []
    try: result_list.append(["M", result["M"] ])
    except: pass
    try: result_list.append(["F", result["F"] ])
    except: pass

    # Calculate percentage results
    for res in result_list:
        if res[0] == "M":
            male = res[1]
        elif res[0] == "F":
            female = res[1]
        male_p = round(male*100/(male+female),2)
        female_p = round(female*100/(female+male),2)
    
    if male_p > female_p:
        gender = "m"
        return gender, male_p
    else:
        gender = "f"
        return gender, female_p

In [26]:
# above works

In [27]:
## Maybe slice the large dataframe with the names that are in the uploaded list befor running stuff
# Should speed it up

## Version with apply

In [28]:
# Add a colum for each checked item

In [29]:
# Check country
def check_country(country):
    return country.lower() in country_list

In [30]:
# Check continent
def check_continent(continent):
    return continent.lower() in continents_list

In [31]:
%%time
df["c_country"] = df["country"].apply(check_country)

CPU times: user 3.98 ms, sys: 931 µs, total: 4.91 ms
Wall time: 3.78 ms

In [32]:
%%time
df["c_continent"] = df["continent"].apply(check_continent)

CPU times: user 3.85 ms, sys: 901 µs, total: 4.75 ms
Wall time: 4.2 ms

In [33]:
# combine in one column

In [34]:

def check_all(row):
    res_list = []
    res_list.append(row['c_country'])
    res_list.append(row["c_continent"])
                     
    return res_list

In [35]:
df

           name  country  continent  c_country  c_continent
0          name  country  continent      False        False
1         marie  austria     europe       True         True
2        sophie  germany     europe       True         True
3    maximilian  germany     europe       True         True
4         maria   brazil   americas       True         True
..          ...      ...        ...        ...          ...
495      dennis      nan        nan      False        False
496      elijah      nan        nan      False        False
497     emanuel      nan        nan      False        False
498       ensar      nan        nan      False        False
499       erich      nan        nan      False        False

[500 rows x 5 columns]

In [36]:
%%time
df["check_all"] = df.apply(check_all, axis=1)

CPU times: user 5.84 ms, sys: 1.37 ms, total: 7.21 ms
Wall time: 5.56 ms

In [37]:
df

           name  country  continent  c_country  c_continent       check_all
0          name  country  continent      False        False  [False, False]
1         marie  austria     europe       True         True    [True, True]
2        sophie  germany     europe       True         True    [True, True]
3    maximilian  germany     europe       True         True    [True, True]
4         maria   brazil   americas       True         True    [True, True]
..          ...      ...        ...        ...          ...             ...
495      dennis      nan        nan      False        False  [False, False]
496      elijah      nan        nan      False        False  [False, False]
497     emanuel      nan        nan      False        False  [False, False]
498       ensar      nan        nan      False        False  [False, False]
499       erich      nan        nan      False        False  [False, False]

[500 rows x 6 columns]

In [38]:

df = df.reset_index(level=0)
df

,index,name,country,continent,c_country,c_continent,check_all
0,0,name,country,continent,False,False,"[False, False]"
1,1,marie,austria,europe,True,True,"[True, True]"
2,2,sophie,germany,europe,True,True,"[True, True]"
3,3,maximilian,germany,europe,True,True,"[True, True]"
4,4,maria,brazil,americas,True,True,"[True, True]"
...,...,...,...,...,...,...,...
495,495,dennis,nan,nan,False,False,"[False, False]"
496,496,elijah,nan,nan,False,False,"[False, False]"
497,497,emanuel,nan,nan,False,False,"[False, False]"
498,498,ensar,nan,nan,False,False,"[False, False]"
499,499,erich,nan,nan,False,False,"[False, False]"

In [46]:
df.shape[0]

500

In [43]:
# try it with apply
def csv_predict_from_data(row):
    """
    Create a temporary dataframe with name and gender in differnt countries
    Adds rows with gender and percentage to the input dataframe 
    """
    n_row = row["index"]
    if n_row%100 == 0:
        print(n_row)
    
    
    if row["check_all"][0]:
        df_name = data[(data["name"] == row["name"] ) & (data["country"] == row["country"])].groupby("gender")["wgt"].sum()
    elif row["check_all"][1]:
        df_name = data[(data["name"] == row["name"] ) & (data["region"] == row["continent"])].groupby("gender")["wgt"].sum()                                                           
    else:
        df_name = data[data["name"] == row["name"].lower() ].groupby("gender")["wgt"].sum()


    if df_name.empty:
        return "No Data", "No Data"
    else:
        gender, perc = csv_share_male_female(df_name)
        return gender, perc

In [44]:
%%time
result = df.apply(csv_predict_from_data, axis=1)

0
10
20
30
40
50
60
70
80
90
100
110
120
130
140
150
160
170
180
190
200
210
220
230
240
250
260
270
280
290
300
310
320
330
340
350
360
370
380
390
400
410
420
430
440
450
460
470
480
490
CPU times: user 785 ms, sys: 1.27 ms, total: 786 ms
Wall time: 756 ms

In [ ]:
def extend_result_and_shorten(df, result):
    
    for index, res in enumerate(result):
        df.loc[index, "gender"] = res[0]
        df.loc[index, "percentage"] = res[1]
        if df.loc[index, "check_all"] == [False, False]:
            df.loc[index, "check_all"] = "Name"
        elif (df.loc[index, "check_all"] == [True, False]) | (df.loc[index, "check_all"] == [True, True]):
            df.loc[index, "check_all"] = "Name and Country"
        elif (df.loc[index, "check_all"] == [False, True]) :
            df.loc[index, "check_all"] = "Name and Continent"
    df = df.rename(columns={"check_all": "method used"})
    return df[["name","country","continent", "method used","gender","percentage"]].copy()

In [ ]:

df_new = extend_result_and_shorten(df, result)

In [ ]:
df_new.sample(5)

In [ ]:
def prepare_output(df_new):
    df_new_short = df[["name","country","continent", "check_all","gender","percentage"]].copy()

In [ ]:
df[["name","country","continent", "check_all","gender","percentage"]]

In [ ]:
df_new.rename(columns={"check_all": "method used"})

In [ ]:
df_new[["gender"]].value_counts()

## Version with iterrow

In [ ]:
# this below works but takes to longn- 1:30 for 500 -> 3min for 1K -> 30min for 10K

In [ ]:
# takes to loong 
def iterrows_predict_from_data(df, data):
    """
    Create a temporary dataframe with name and gender in differnt countries
    Adds rows with gender and percentage to the input dataframe 
    """
    # Still takes to long - need to be converted into apply or applymap
    for index, row in df.iterrows():

        if df.loc[index, "name"] != "nan" and df.loc[index, "country"].lower() in country_list :
            print("name and country")
            df_name = data[(data["name"] == df.loc[index, "name"].lower()) & (data["country"] == df.loc[index, "country"])].groupby("gender")["wgt"].sum()
        elif df.loc[index, "name"] != "nan" and df.loc[index, "continent"] in continents_list:
            print("name and continent")
            df_name = data[(data["name"] == df.loc[index,"name"].lower()) & (data["region"] == df.loc[index, "continent"])].groupby("gender")["wgt"].sum()
        elif df.loc[index,"name"] != "nan":
            print("only name")
            df_name = data[data["name"] == df.loc[index, "name"].lower()].groupby("gender")["wgt"].sum()
        else:
            print("no data given")
            df.loc[index,"gender"] = "Name not found"

        if df_name.empty:
            df.loc[index, "gender"] = "No Data"
            df.loc[index, "percentage"] = "No Data"
        else:
            gender, perc = share_male_female(df_name)
            df.loc[index, "gender"] = gender
            df.loc[index, "percentage"] = perc
            
        print(index)

    return  df

In [ ]:
# Calculate for uploaded Datafram

In [ ]:
%%time
df_new = iterrows_predict_from_data(df, data)

In [ ]:
df_new["gender"].value_counts()

# Save Result

In [ ]:
# Choose file
path_save = os.path.join("..","raw_data","test",f"genderized-{filename}")
path_save

In [ ]:
df_new.to_csv(path_save, index=False)

# Add more data to database

## Original Data to extend

In [157]:
path = os.path.join("..","raw_data","wgnd_2_0_name-gender-code.csv")
data = pd.read_csv(path)

In [187]:
# Structure we need in current data
data.head()

  name code gender       wgt
0    a   AU      M  1.000000
1    a   BE      F  0.348178
2    a   BE      M  0.651822
3    a   CA      F  0.214286
4    a   CA      M  0.785714

## Data use to extend

### Open file and check for duplicated names - Names that are female and male

In [159]:
path = os.path.join("..","raw_data","indian-1.csv")
data_2 = pd.read_csv(path)

In [160]:
data_2.head()

       Name Gender
0     Aaban      m
1  Aabharan      m
2    Aabhas      m
3    Aabhat      m
4   Aabheer      m

In [161]:
duplicated_data = data_2[data_2["Name"].duplicated(keep=False)].sort_values("Name")
duplicated_data.shape

(114, 2)

In [162]:
unique_data = data_2.drop_duplicates()
unique_data.head(4)

       Name Gender
0     Aaban      m
1  Aabharan      m
2    Aabhas      m
3    Aabhat      m

In [163]:
unique_data.shape

(53982, 2)

### Add country code

In [164]:
# Here is file with country code
path_cc = os.path.join("..","raw_data","country-code","all-country-codes_continent_subregion.csv")
cc_all = pd.read_csv(path_cc, sep=",")

In [165]:
# Search alpha-2 code
cc_all[cc_all["name"] == "India"]

,name,alpha-2,alpha-3,country-code,iso_3166-2,region,sub-region,intermediate-region,region-code,sub-region-code,intermediate-region-code
105,India,IN,IND,356,ISO 3166-2:IN,Asia,Southern Asia,NaN,142.0,34.0,NaN

In [166]:
data_2

            Name Gender
0          Aaban      m
1       Aabharan      m
2         Aabhas      m
3         Aabhat      m
4        Aabheer      m
...          ...    ...
53977    Zumathy      f
53978     Zurika      f
53979    Zuruthi      f
53980  Zuruthika      f
53981     Zuvaka      f

[53982 rows x 2 columns]

In [167]:
# add column on specific position - (position, "column-name", "data")
duplicated_data.insert(1, 'code', "IN")

In [168]:
unique_data.insert(1, 'code', "IN")

In [169]:
duplicated_data.head(3)

         Name code Gender
82     Aaftab   IN      m
29473  Aaftab   IN      f
214     Aarya   IN      m

In [170]:
unique_data.head(3)

       Name code Gender
0     Aaban   IN      m
1  Aabharan   IN      m
2    Aabhas   IN      m

### Add Gender

### Unique Data - weigth - 100%

In [171]:
unique_data["wgt"] = 1.000000

In [172]:
unique_data.head(3)

       Name code Gender  wgt
0     Aaban   IN      m  1.0
1  Aabharan   IN      m  1.0
2    Aabhas   IN      m  1.0

### Double Gender Name Data - weigth - ?%

In [173]:
# Decide how to do it - for now we just simplify and do 50% - 50%

In [174]:
duplicated_data["wgt"] = 0.500000

In [175]:
duplicated_data.head(3)

         Name code Gender  wgt
82     Aaftab   IN      m  0.5
29473  Aaftab   IN      f  0.5
214     Aarya   IN      m  0.5

### Column names and Gender Capitalize

In [176]:
duplicated_data.columns = ['name', 'code', 'gender', 'wgt']
unique_data.columns = ['name', 'code', 'gender', 'wgt']

In [ ]:
# Make gender column in caps letter

In [184]:
duplicated_data["gender"] = duplicated_data["gender"].apply(lambda x: x.upper())

In [186]:
unique_data["gender"] = unique_data["gender"].apply(lambda x: x.upper())

## Vergleich

In [188]:
# Here is the target
data.head()

  name code gender       wgt
0    a   AU      M  1.000000
1    a   BE      F  0.348178
2    a   BE      M  0.651822
3    a   CA      F  0.214286
4    a   CA      M  0.785714

In [189]:
unique_data.head()

       name code gender  wgt
0     Aaban   IN      M  1.0
1  Aabharan   IN      M  1.0
2    Aabhas   IN      M  1.0
3    Aabhat   IN      M  1.0
4   Aabheer   IN      M  1.0

In [190]:
duplicated_data.head()

         name code gender  wgt
82     Aaftab   IN      M  0.5
29473  Aaftab   IN      F  0.5
214     Aarya   IN      M  0.5
29207   Aarya   IN      F  0.5
501     Adeel   IN      M  0.5

# Concatinate

In [197]:
data_extended = pd.concat([data, unique_data], axis=0)

In [198]:
data_extended

            name code gender       wgt
0              a   AU      M  1.000000
1              a   BE      F  0.348178
2              a   BE      M  0.651822
3              a   CA      F  0.214286
4              a   CA      M  0.785714
...          ...  ...    ...       ...
53977    Zumathy   IN      F  1.000000
53978     Zurika   IN      F  1.000000
53979    Zuruthi   IN      F  1.000000
53980  Zuruthika   IN      F  1.000000
53981     Zuvaka   IN      F  1.000000

[5024268 rows x 4 columns]